docs/2016/redhat-linux-dropbox-proxy-install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Install dropbox over proxy on RHEL7</title>
<meta name="author" content="clothoid" />
<meta name="keywords" content="dropbox redhat linux proxy" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Install dropbox over proxy on RHEL7</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9523a98">1. 環境</a></li>
<li><a href="#orgc81c237">2. 環境変数 HTTP_PROXY の設定</a></li>
<li><a href="#org3b48c12">3. wgetrc の設定</a></li>
<li><a href="#org9d869c3">4. dropbox のインストール</a></li>
<li><a href="#org9326e14">5. yum の設定</a></li>
<li><a href="#org04e4138">6. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9523a98" class="outline-2">
<h2 id="org9523a98"><span class="section-number-2">1.</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Red Hat Enterprise Linux Server release 7.2 (Maipo)</li>
<li>nautilus-dropbox 2015.10.28-1</li>
</ul>
</div>
</div>
<div id="outline-container-orgc81c237" class="outline-2">
<h2 id="orgc81c237"><span class="section-number-2">2.</span> 環境変数 HTTP_PROXY の設定</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">export http_proxy = "http://proxy_adress:port/"
export https_proxy = "http://proxy_adress:port/"
export ftp_proxy = "http://proxy_adress:port/"
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b48c12" class="outline-2">
<h2 id="org3b48c12"><span class="section-number-2">3.</span> wgetrc の設定</h2>
<div class="outline-text-2" id="text-3">
<p>
~/.wgetrc に以下のように記載 <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>
<div class="org-src-container">
<pre class="src src-sh">HTTP_PROXY     = http://proxy_adress:port/
http_proxy     = http://proxy_adress:port/
HTTPS_PROXY    = http://proxy_adress:port/
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d869c3" class="outline-2">
<h2 id="org9d869c3"><span class="section-number-2">4.</span> dropbox のインストール</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sh">sudo yum install libgnome
wget -O nautilus-dropbox-2015.10.28-1.fedora.x86_64.rpm "https://www.dropbox.com/download?dl=packages/fedora/nautilus-dropbox-2015.10.28-1.fedora.x86_64.rpm"
sudo rpm -ivh nautilus-dropbox-2015.10.28-1.fedora.x86_64.rpm
dropbox start -i 
</pre>
</div>
</div>
</div>
<div id="outline-container-org9326e14" class="outline-2">
<h2 id="org9326e14"><span class="section-number-2">5.</span> yum の設定</h2>
<div class="outline-text-2" id="text-5">
<p>
このままだと、yum った時に以下のようなエラーが出る。
</p>

<pre class="example" id="org78ba52a">
http://linux.dropbox.com/fedora/7Server/repodata/repomd.xml: [Errno 14] HTTP Error 404 - Not Found Trying other mirror.
</pre>

<p>
これは dropbox.repo が $releasever を利用していて、fedra のそれと redhat のそれが合わないため。
</p>

<pre class="example" id="org7c0f134">
sudo yum-config-manager --disablerepo=Dropbox
</pre>

<p>
と無効化してしまうか、
</p>

<pre class="example" id="org8a7f316">
--- /etc/yum.repos.d/dropbox.repo.orig	2016-08-15 02:57:27.950632263 -0400
+++ /etc/yum.repos.d/dropbox.repo	2016-08-15 02:57:39.710632263 -0400
@@ -1,4 +1,4 @@
 [Dropbox]
 name=Dropbox Repository
-baseurl=http://linux.dropbox.com/fedora/$releasever/
+baseurl=https://linux.dropbox.com/fedora/24/
 gpgkey=https://linux.dropbox.com/fedora/rpm-public-key.asc
</pre>

<p>
などと、指定してしまう。
</p>
</div>
</div>

<div id="outline-container-org04e4138" class="outline-2">
<h2 id="org04e4138"><span class="section-number-2">6.</span> 参考</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="http://www.techonia.com/790/install-dropbox-centos-7">How to install Dropbox on CentOS 7 – Techonia</a></li>
<li><a href="https://www.dropbox.com/ja/install?os=linux">アプリ - Dropbox (JP)</a></li>
<li><a href="https://ask.fedoraproject.org/en/question/27217/why-doesnt-the-dropbox-repository-for-fedora-19-work/">Why doesn't the Dropbox repository for Fedora 19 work? - Ask Fedora: Community Knowledge Base and Support Forum</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
他ソフトで、大文字、小文字両方定義しておいた方がいい場合があったので。。。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
